0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;              // This is "Turbulent Viscosity"
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{ 
    inlet-I
    {
        type            calculated;
        value           $internalField;
    }


    inletWall-III
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    topWall
    {
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    internalWall
    {
        type            nutkWallFunction;
        value           $internalField;
    }


    #include "include/patchesWalls"

}


// ************************************************************************* //
