constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet-I
    {
        type            patch;
        nFaces          400;
        startFace       1278000;
    }
    inletWall-III
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       1278400;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       1278800;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          640000;
        startFace       1279600;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          640000;
        startFace       1919600;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       2559600;
    }
    internalWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       2560400;
    }
)

// ************************************************************************* //
